import { COLOR_THEME } from "../../core/blockly/constants/colors";

export default `
<category name="Логика" colour="${COLOR_THEME.CONTROL}">
    <block type="control_if">
        <comment pinned="false" h="150" w="460">"«Егер блоктар» «Егер» бөлімінде не бар болса, онда «Егер» бөлімінде не бар болса, «ақиқат» болса, онда кодты іске қосады. «Егер» бөліміне is_button_pressed блогын қоссаңыз және түйме басылса, онда бөлімнің коды іске қосылады..</comment>
    </block>
    <block type="controls_ifelse">
<comment pinned="false" h="150" w="460">If Else блоктары" "Егер" бөліміндегі нәрсе "Егер" бөліміне тіркелгені "ақиқатқа" тең болса, онда "Сосын" бөліміндегі кодты іске қосады. Егер сіз is_button_pressed блогын IF бөліміне қоссаңыз және түйме басылса, онда бөлімнің коды іске қосылады. Түйме басылмаса, басқа бөлім іске қосылады.</comment>
    </block>
    <block type="logic_compare">
    <comment pinned="false" h="140" w="527">Сол және оң жақ тесіктердегі нәрсені салыстырады және ақиқат немесе жалғанды ​​қайтарады.

Егер оператор = болса, ол екі мәннің де бірдей екенін тексереді.
Оператор \u2260 болса, ол екі мәннің де әртүрлі екенін тексереді.</comment>
    </block>
    <block type="logic_operation">
<comment pinned="false" h="170" w="527">Сол және оң жақ тесіктердегі нәрсені салыстырады және ақиқат немесе жалғанды ​​қайтарады.

Оператор «және» болса, ол екі мәннің ақиқатқа тең екенін тексереді.
Егер оператор «немесе» болса, ол мәндердің біреуінің ақиқат екенін тексереді.</comment>
    </block>
    <block type="logic_negate">
    <comment pinned="false" h="80" w="460">Шындықты қабылдап, оны жалғанға айналдырады, ал жалғанды ​​қабылдап, оны шындыққа айналдырады.</comment>
    </block>
    <block type="logic_boolean"></block>
</category>
`;
